lexs-4.0/xml/SN-samples/Notify-TopicSubscriptionNotification.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
              xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <env:Header>
        <wsa:MessageID>http://www.cjis.fbi.gov/N-DEx/NotificationService/308</wsa:MessageID>
        <wsa:To>http://www.cjis.fbi.gov/OneDOJ/017</wsa:To>
        <wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationConsumer/Notify</wsa:Action>
    </env:Header>
    <env:Body>
        <wsnt:Notify xmlns:ulex="http://ulex.gov/ulex/2.0"
                   xmlns:ulexsr="http://ulex.gov/searchretrieve/2.0"
                   xmlns:ulexsn="http://ulex.gov/subscribenotify/2.0"
                   xmlns:ulexcodes="http://ulex.gov/codes/2.0"
                   xmlns:ulexlib="http://ulex.gov/library/2.0"
                   xmlns:j="http://niem.gov/niem/domains/jxdm/4.1"
                   xmlns:nc="http://niem.gov/niem/niem-core/2.0"
                   xmlns:em="http://niem.gov/niem/domains/emergencyManagement/2.0"
                   xmlns:im="http://niem.gov/niem/domains/immigration/2.0"
                   xmlns:scr="http://niem.gov/niem/domains/screening/2.0"
                   xmlns:s="http://niem.gov/niem/structures/2.0"
                   xmlns:lexs="http://lexs.gov/lexs/4.0"
                   xmlns:lexsdigest="http://lexs.gov/digest/4.0"
                   xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:tns="http://usdoj.gov/topicSpace/alerts"
                   xsi:schemaLocation="http://docs.oasis-open.org/wsn/b-2 ../../xsd/oasis-open.org/wsn/b-2/b-2.xsd">

         <wsnt:NotificationMessage>
            <wsnt:SubscriptionReference>
               <wsa:Address>http://www.cjis.fbi.gov/N-DEx/NotificationService/12345</wsa:Address>
            </wsnt:SubscriptionReference>
            <wsnt:Topic Dialect="http://docs.oasis-open.org/wsn/t-1/TopicExpression/Concrete">
        tns:DHS/TerroristAlert
        </wsnt:Topic>
            <wsnt:Message>
               <ulexsn:TopicSubscriptionNotification>
                  <ulex:SNMessageMetadata>
                    <ulex:ULEXFrameworkVersionText>2.0</ulex:ULEXFrameworkVersionText>
                    <ulex:ULEXImplementation>
                        <ulex:ULEXImplementationVersionText>4.0</ulex:ULEXImplementationVersionText>
                        <ulex:ULEXImplementationName>LEXS</ulex:ULEXImplementationName>
                    </ulex:ULEXImplementation>
                    <ulex:MessageDateTime>2006-12-17T09:30:47.0Z</ulex:MessageDateTime>
                    <wsa:MessageID>http://www.cjis.fbi.gov/N-DEx/NotificationService/308</wsa:MessageID>
                    <wsa:RelatesTo>http://www.cjis.fbi.gov/OneDOJ/413</wsa:RelatesTo>
                    <!--=======================  Message Origin  =======================-->
                    <ulex:MessageOriginMetadata>
                        <lexs:SystemIdentifier>
                            <!-- OriginatingAgencyID is optional here and was not included in the sample  -->
                            <nc:OrganizationName>Hypothetical Organization E</nc:OrganizationName>
                            <lexs:SystemID>SysE</lexs:SystemID>
                        </lexs:SystemIdentifier>
                        <lexs:SystemContact>
                            <nc:PersonGivenName>Jim</nc:PersonGivenName>
                            <nc:PersonSurName>West</nc:PersonSurName>
                            <nc:ContactTelephoneNumber>
                                <nc:FullTelephoneNumber>
                                    <nc:TelephoneNumberFullID>770-555-1212</nc:TelephoneNumberFullID>
                                </nc:FullTelephoneNumber>
                            </nc:ContactTelephoneNumber>
                        </lexs:SystemContact>
                    </ulex:MessageOriginMetadata>
                    <!--====================== Message Destination ==========================-->
                    <lexs:MessageDestinationIdentifier>
                        <!-- OriginatingAgencyID is optional here and was not included in the sample  -->
                        <nc:OrganizationName>Hypothetical Organization F</nc:OrganizationName>
                        <lexs:SystemID>SysF</lexs:SystemID>
                    </lexs:MessageDestinationIdentifier>
                  </ulex:SNMessageMetadata>
                  <!--=========================================================-->
                <!--=======================  Package #1  =======================-->
                <!--=========================================================-->
                <ulex:DataItemPackage>
                    <ulex:PackageMetadata>
                        <ulex:DataItemID>12345678</ulex:DataItemID>
                        <!-- DataItemContact is the person(s) who can be contacted about the data item  -->
                        <!-- DataItemContact is optional, and there can be more than one -->
                        <lexs:DataItemContact>
                            <!-- PersonName may be a split out name, or both a split out name and a full name.  Last name is required. -->
                            <nc:PersonSurName>Jackson</nc:PersonSurName>
                            <nc:PersonFullName>David Jackson</nc:PersonFullName>
                            <!-- Contact telephone number is required, other kinds of numbers optional -->
                            <nc:ContactTelephoneNumber>
                                <nc:FullTelephoneNumber>
                                    <!-- Full phone number listed here, although the phone number could be split into parts -->
                                    <nc:TelephoneNumberFullID>333-444-5555 x6</nc:TelephoneNumberFullID>
                                </nc:FullTelephoneNumber>
                            </nc:ContactTelephoneNumber>
                            <lexs:DataContactDomainAttribute>
                                <ulex:AttributeName>ContactRole</ulex:AttributeName>
                                <ulex:AttributeValueText>Arresting Officer</ulex:AttributeValueText>
                                <ulex:DomainName>GBI</ulex:DomainName>
                            </lexs:DataContactDomainAttribute>
                        </lexs:DataItemContact>
                        <ulex:DataItemDate>2006-12-13</ulex:DataItemDate>
                        <!-- DataItemReferenceID may be the same as the DataItemID, or may be a more human-readable version of DataItemID -->
                        <ulex:DataItemULEXImplementation>
                            <ulex:ULEXImplementationVersionText>4.0</ulex:ULEXImplementationVersionText>
                            <ulex:ULEXImplementationName>LEXS</ulex:ULEXImplementationName>
                        </ulex:DataItemULEXImplementation>
                        <ulex:DataItemReferenceID>1912345678</ulex:DataItemReferenceID>
                        <lexs:DataItemStatusText>Closed_Case</lexs:DataItemStatusText>
                        <!--=======================  Data Owner Metadata  =======================-->
                        <ulex:DataOwnerMetadata>
                            <lexs:DataOwnerIdentifier>
                                <lexs:OriginatingAgencyID>AA1234567</lexs:OriginatingAgencyID>
                                <nc:OrganizationName>Hypothetical Agency A</nc:OrganizationName>
                                <lexs:SystemID>SysA</lexs:SystemID>
                            </lexs:DataOwnerIdentifier>
                            <lexs:DataOwnerContact>
                                <nc:PersonGivenName>Will</nc:PersonGivenName>
                                <nc:PersonSurName>Jones</nc:PersonSurName>
                                <nc:ContactTelephoneNumber>
                                    <nc:FullTelephoneNumber>
                                        <nc:TelephoneNumberFullID>111-222-3333</nc:TelephoneNumberFullID>
                                    </nc:FullTelephoneNumber>
                                </nc:ContactTelephoneNumber>
                                <lexs:DataContactDomainAttribute>
                                    <ulex:AttributeName>ContactRole</ulex:AttributeName>
                                    <ulex:AttributeValueText>RMS Manager</ulex:AttributeValueText>
                                    <ulex:DomainName>GBI</ulex:DomainName>
                                </lexs:DataContactDomainAttribute>
                            </lexs:DataOwnerContact>
                        </ulex:DataOwnerMetadata>
                        <lexs:DisseminationCriteria>
                            <lexs:DisseminationCriteriaDomainName>Test</lexs:DisseminationCriteriaDomainName>
                            <lexs:DisseminationCriteriaText>white</lexs:DisseminationCriteriaText>
                        </lexs:DisseminationCriteria>
                    </ulex:PackageMetadata>
                    <!--=======================  Digest  =======================-->
                    <lexs:Digest>
                        <lexsdigest:EntityPerson>
                            <lexsdigest:Person s:id="Sub1">
                                <nc:PersonName>
                                    <nc:PersonGivenName>Tommy</nc:PersonGivenName>
                                    <nc:PersonSurName>Jones</nc:PersonSurName>
                                </nc:PersonName>
                            </lexsdigest:Person>
                        </lexsdigest:EntityPerson>
                    </lexs:Digest>
                  </ulex:DataItemPackage>
               </ulexsn:TopicSubscriptionNotification>
            </wsnt:Message>
         </wsnt:NotificationMessage>
      </wsnt:Notify>
    </env:Body>
</env:Envelope>